Intro

HR / People & Talent leader with extensive experience in high-growth tech and sustainability-focused organisations, building people functions and scaling teams from early stage to mature operations. I combine strategic thinking with hands-on delivery across recruitment, HR operations, culture, engagement, and L&D. With a background spanning AI, green tech, and blockchain, I thrive in purpose-led, fast-paced environments where I can shape structures, improve processes, and catalyse teams to perform at their best. My copious energies, combined with a deep commitment to the organisation's values, objectives, and people, enabled me to support leaders and teams in achieving ambitious goals.

Work Experience

Qflow – HR & People Manager (UK, US)                                                                           08/2023 – 07/2025 | SaaS AI Green ConTech 
Qflow assists construction teams in collecting real-time data, reducing costs, enhancing quality & preventing pollution.
Strategic Leadership - Built organisational foundations and scalable HR systems and frameworks by establishing the HR and people function, creating a people agenda that enabled a remote-first startup to scale sustainably. 
HR Business Partnering - Partnered with leadership to identify and remove performance blockers, translating workforce insights into strategies that improved team velocity and engagement. Designed and implemented thought-provoking data dashboards to visualise performance trends, retention and hiring metrics, directly supporting decision-making at SLT level.
Employee Experience - Strengthened culture, social initiatives, and engagement. Developed the company’s first performance process, linking individual impact to company growth metrics. Shaped simple, scalableprocesses - onboarding, offboarding, L&D, wellbeing, DEI, and feedback frameworks. Achieving above 85% satisfaction and less than 12% annual turnover.
Growth - Led high-volume recruitment across technical, engineering, product and commercial roles. Significantly reducing time-to-hire and cost-per-hire, while doubling team size within a year.
HR Operations, Systems and Data - Led successful B Corp certification. Ensured ongoing compliance with UK employment law and regulations. Implemented an integrated HRIS, ATS, and payroll platform, significantly improving efficiency and data accuracy. Managed complete system configuration, data migration, and training for managers and employees. 
Compensation & Benefits - Managed payroll, benefits, and compensation processes.
The role was redundant due to company's downsizing.

Ecologi - People & Culture Manager (UK, US)                                                                                      5.2022 - 1.2023 | SaaS Green Tech 
Ecologi provides businesses with the tools, information, and guidance needed at every stage of their journey to net-zero.
Main achievements: 
Established the People and Talent function and team from the ground up. Defined and delivered the company’s people agenda and HR strategy, talent management, and employee experience to align business roadmap and growth plans.
Partnered with leadership to forecast hiring needs, build a scalable pipeline and design inclusive hiring processes.
Supported senior leadership through organisational restructuring and management transitions that improved decision-making velocity. Achieved over 50% increase in DEI metrics. 83% of employees reported feeling valued.
The role was redundant due to company’s unsuccessful investment round. (Took 6 months’ maternity leave after leaving).

NICE Actimize LTD - HRBP EMEA (UK, Spain, Germany, France, South Africa, Israel, India)        9.2019 - 4.2022 | Global FinTech 
Actimize provides financial crime, risk, and compliance solutions to prevent fraud, money laundering, and other regulatory risks.
Main achievements:
Partnered with a people group of 250+ across EMEA, providing both consultative and hands-on HR advice. Supported senior stakeholders to address performance challenges, restructure teams, and strengthen leadership capability. 
Partnering managers in transitioning to remote work during COVID-19, redesigning policies and communication frameworks to support employee wellbeing, maintain engagement, and ensure business continuity amid unprecedented uncertainty.
Recognised for successfully driving people initiatives in a highly complex, global matrix organisation.
Left the company due to relocation from London to Newcastle Upon Tyne.

Applied Blockchain - Talent Acquisation & People Manager (UK, Portugal)                                         12.2016 - 8.2019 | Blockchain 
ABC provides blockchain solutions that enable secure, scalable, and compliant digital asset management and automation.
Main achievement: 
Established the company’s first standalone People function, reporting directly to the Founder & CEO. Designed and implemented HR processes, policies, and frameworks from the ground up to support rapid business growth.
Designed and implemented scalable people architecture that supported growth from 10 → 70 employees in 18 months.
Shaped data-driven hiring and performance systems that reduced bottlenecks.
Introduced structured HR and recruitment initiatives to replace manual processes, standardising workflows across hiring, onboarding, performance and progression.  Partnered with leadership to define scalable processes to ensure compliance,  consistency across teams and alignment to company culture and values.
Successfully established an offshore engineering hub in Porto, Portugal, leading entity setup, local compliance, and hiring. Oversaw onboarding, local HR processes, and alignment with UK operations.
Launched engagement initiatives that strengthened culture and retention in a fast-paced, high-growth environment.
Left to take on a new role offering greater responsibility and professional growth.

Babcom Centres - Matrix Group  - HR & Talent Manager                                                9.2009 - 9.2016 | Customer Service Centres
Babcom specialises in establishing and managing customer service centres for clients across various sectors and countries.
Main achievements: 
Joined as the first recruitment professional when the organisation had 60 employees and built the HR function, team, and department from the ground up.
Supported the organisation’s rapid growth, scaling headcount from 60 to 2,000 in 6 different locations over seven years.
Progressed from Recruiter to HR Business Partner, eventually leading a 6-person talent team and department.
Initiated and led a diversity project enabling 500 minority women to enter the job market for the first time. 
Left due to relocation to the UK.

Education

M.A. Sociology, Research and Thesis Programme, Ben Gurion University 2007 - 2011
B.A. Behavioural Studies, Ben Gurion University 2003 - 2006

Tools & Platforms

BambooHR, Teamtailor, Greenhouse, Workable, Linkedin Recruiter, Oracle, Hibob, SAP, ADP, BrightPay, Employment Hero, Trello, Miro, Google Workspace, Microsoft Office, Perkbox, Teams, Slack, Zoom, Outlook, CanvaAI

Volunteering Highlights

Extinction Rebellion (2016–Present): Environmental activist
Mountfield Primary School (2022-2024): As a SEND Governor, I contributed to strategic oversight, governance, and collaboration between school leadership and the parent community.
Organic Community Garden: (2012-2016): Built an inclusive community space bringing together residents to promote environmental awareness, local engagement and collective ownership.
Combatants for Peace (2004–2010): Founded and led the South Mount Hebron student team, developing joint Israeli-Palestinian nonviolent initiatives and long-term community support work.
Machsom Watch (2004 - 2010): Initiated the southern student group of a female-led Israeli human rights organisation monitoring military checkpoints. Coordinated volunteers, reported and documented human rights violations and contributed to international awareness. Worked closely with civil society organisations, international activists, and stakeholders.
